package app.nahehuo.com.bean;

import java.util.List;

/**
 * Created by Administrator on 2016/3/17.
 */
public class NetCompProgress {

    /**
     * message : 企业历程获取成功
     * code : 200
     * data : [{"gid":74,"title":"阅览室新书上架啦","content":"公司六楼阅览室已整理完毕，目前上架图书有300多册，后续还有近千本图书将陆续入库，分为政治经济类、成功励志类、教辅类、名人传记类、小说、文学、艺术、杂志等系列。图书室向今翌全体员工开放，午间休息时，同事们可以在阅览室内阅读，阅览室设有书桌和座椅，可容纳10人左右。同时，节假日休息时，同事们可以办理相关手续，将书籍带回去阅读。\n公司图书室的建立，开拓了员工的知识面，提高员工的文化修养，让员工有了一个更加丰富多彩的工作环境。","pic":"http://test2015.zcspin.com/thumb/9/8/15/1381_big.jpg","week":"周一","date":"2014-08-18"},{"gid":75,"title":"热烈祝贺今翌信息科技乔迁之喜！","content":"今翌公司迁至松江区，是公司战略性发展的一次飞跃，今翌公司旗下的上海沁蓝服饰有限公司、上海卡旗服饰有限公司、上海思博体育管理有限公司也一同搬迁至新办公楼，公司实行统一管理。此次搬迁为公司规模的进一步扩大以及品牌形象的提升提供了强有力的基础。\n 公司总部乔迁之后，我们仍将一如既往地本着\u201c胸怀梦想，立足现在，把握未来\u201d的企业宗旨，不怕奋争，做到\u201c言必行，行必果\u201d，并且已经走在路上，脚步坚实。\n    看今朝，我们踌躇满志；展未来，我们豪情满怀。在公司总部乔迁之际，非常感谢公司员工长期以来的努力工作使公司不断发展壮大，愿我们今翌人共同进步，共同发展。","pic":"http://test2015.zcspin.com/thumb/1/2/37/3099_big.jpg","week":"周五","date":"2014-06-27"},{"gid":29,"title":"今翌新环境","content":"炎炎夏日，一个良好舒适的工作环境将使我们拥有更加健康的体魄和美丽的心情。近日，通过大家的共同努力，成功改善了我们的工作环境，寄休闲于工作中，极大地提高了大家的工作效率。","pic":"http://test2015.zcspin.com/thumb/7/f/94/867_big.jpg","week":"周三","date":"2013-08-14"},{"gid":28,"title":"Toll亚洲总裁Lou Milicevic一行参观访问e速代购","content":"2013年6月4日上午，国际速递toll亚洲总裁Lou Milicevic及随行人员莅临e速代购进行参观访问，并与e速代购高层进行了会晤交流。","pic":"http://test2015.zcspin.com/thumb/2/4/6a/866_big.jpg","week":"周一","date":"2013-06-03"},{"gid":30,"title":"思博足球队诞生啦","content":"2013年6月，上海思博户外拓展培训机构，在南北湖户外拓展培训基地，为国核工程有限公司的员工进行了两天一夜的户外拓展。\r\n\r\n本次拓展活动把妙趣横生的游戏同工作、生活、学习有机地联系在了一起，给国核的员工带来了无穷的乐趣、信心和勇气。回顾在训练中受的挑战和磨练，国核员工说到：\u201c这次训练，是一次身心的大洗礼，是进一步推动我全力以赴作好各项工作的动力。它不仅仅是一种简单的训练，而是一种文化、一种精神、一种理念；同时也是一种思维、一种考验、一种气概。真正实现了认识自我，挑战自我，超越自我的目标，更熔炼了一支坚强，团结的优秀团队。\u201d","pic":"http://test2015.zcspin.com/thumb/1/5/32/868_big.jpg","week":"周五","date":"2013-05-31"},{"gid":27,"title":"青春校园风再度席卷ChinaJoy\u2014\u2014大学明天的奇袭！","content":"ChinaJoy正是看中了大学明天丰富的资源与广阔的前景，意图与之携手共同打造青春校园风活动。\u201c缔造美丽，青春洋溢\u201d计划将深入校园，旨在让当代大学生展现自己的风采，秀出青春活力！\r\n\r\n大学明天作为ChinaJoy官方招聘合作伙伴，曾多次与之携手，成功帮助高校大学生，当选盛大、网易、新浪、腾讯等多家网络媒体公司的ChinaJoy展台及主推Showgirl&amp;Gameboy。只要你够自信，只要你够活力，都可以来秀出你最靓丽的风采！","pic":"http://test2015.zcspin.com/thumb/8/8/06/865_big.jpg","week":"周四","date":"2013-05-16"},{"gid":26,"title":"热烈祝贺\u201ce梦村\u201d白领公寓隆重开业","content":"想要品味海派、小资的生活方式吗？那就来E梦村!\r\n\r\nE梦村白领公寓是今翌信息（科技）有限公司投资，并按三星级客房标准兴建的综合性白领公寓，总面积达4500平米。位于上海市浦东新区川沙镇的中心地段\u2014\u2014川沙镇川沙路3639号，联系电话021-68796838  68796836。","pic":"http://test2015.zcspin.com/thumb/4/1/da/864_big.jpg","week":"周六","date":"2013-04-27"},{"gid":25,"title":"今翌\u2014\u2014浪漫的温情之旅","content":"每个人，每天花在办公室的时间最少占了一天的三分之一，或者多或者少，所以，公司可以称得上是我们的第二个家。今翌一直崇尚快乐办公、快乐生活，努力为员工打造一个温馨舒适的办公环境，让每一个员工都有归属感，让我们为了生活而生活，而不是为了工作而工作\u2026\u2026\r\n\r\n在这里，有我们欢心的笑颜；\r\n在这里，有我们奋斗的成果；\r\n在这里，我们也曾熬夜苦战；\r\n在这里，我们也收获许多；","pic":"http://test2015.zcspin.com/thumb/0/5/eb/863_big.jpg","week":"周四","date":"2013-03-28"},{"gid":24,"title":"7月1日大学明天新版启动 暑期兼职实习正当时","content":"感谢各位会员一直以来对大学明天的支持和拥护，为了给会员们带来更直接的体验和更便捷的服务，大学明天近期全面改版。新版依然保留兼职、实习两大版块，这是童靴们混迹在大学明天的大本营，当然要做保留内容啦，在此基础上新增了扎堆小组、职场Show等新功能。","pic":null,"week":"周六","date":"2012-06-30"},{"gid":23,"title":"万千之中寻找美、提供美、成就美， 6月1日全新上线","content":"2012年6月1日，千寻美网站正式全面上线。美与时尚一直是年轻女性生活中不断追逐的焦点，作为一个新型的女性买家分享社区，千寻美专注于提供发现美与时尚、分享购物乐趣，结交志趣相投好友自由交流的平台。区别于传统的B2B、C2C，千寻美通过细致的模块划分，让使用者获得更多更好更适合的选择，不是大海捞针般的盲目寻找，而是在他人已经分享的美丽宝贝里去寻找适合自己那份美丽，或是让品味一直眼光独到的达人们友情推荐，这很好地为忙碌工作的年轻女性提供更好更优质且性价比更高的宝贝。","pic":null,"week":"周四","date":"2012-05-31"},{"gid":22,"title":"新开工厂，为华诺摩邨品牌产品提供保障","content":"华诺摩邨品牌牛仔裤自生产上线以来，一直广泛受到顾客的支持与亲睐，公司成立之初，就专注牛仔裤的批发与零售，拥有自己的独立工厂和牛仔裤专业设计团队,始终把最优质的产品开发到我们的客户。\r\n\r\n近期， 随着业务的不断扩大，为了给客户群体及时的提供货源和产品的质量提供保障，新建工厂已经正式运行，新建工厂面积达10000平方米，设备齐全，拥有一批专业的技术人员和资深的管理团队，我们注重每一个环节，从产品研发到生产再到销售，都全心全意为您做到最好！我们相信，在不久的将来，华诺摩邨品牌牛仔裤，不仅仅会是一个品牌，它将成为一种文化，成为我们日常生活中必不可少的一部份！","pic":"http://test2015.zcspin.com/thumb/5/a/ec/862_big.jpg","week":"周四","date":"2012-03-15"},{"gid":21,"title":"一线代购与Tool合作","content":"一线代购与Tool合作，为新加坡、马来西亚、澳洲、英国顾客提供了便捷的专线运输方式，此专线服务优质，效率高，费用低廉，速度堪比国内快递，让用户真正享受到了无国界跨国购物，自推出以来受到了很多顾客的好评，此运输方式的推出给一线带来了大量的新加坡、马来西亚顾客。我们将不断提升服务，开发更多的运输方式等给客户带来实惠的政策，为广大用户省钱、省时。","pic":null,"week":"周六","date":"2011-10-08"},{"gid":15,"title":"政府领导到今翌传媒参观并做指导工作","content":"2010年6月10日上午，上海市社会工作党委秘书长袁建国、徐汇区区委办主任李成华、徐汇区区委组织部副部长彭秋萍等领导来到大学生创业创新园，就大学生创业情况进行调研。创业中心总经理韩宝富、副总经理赖浩锋陪同。\n\n领导们分别参观了背包族区域、商业配套区域和重点大学生企业。韩总详细介绍了创业中心为培育大学 生企业、培养创新创业人才所作的工作。经过一年多的努力，大学生创业创新园已经累计培育了53家大学生企业，企业存活率达到78%，高于社会平均水平。\n\n随后，领导们到今翌文化传播有限公司以及旗下大学明天参观，详细了解了大学明天杂志以及大学明天网站里面的内容及其业务，领导说这是个很好的针对大学生的企业，领导还了解了今翌传媒的专业背景和创业经历，并勉励我们要克服暂时的困难，在党和政府的支持下，一定能够走出精彩的创业之路。","pic":null,"week":"周三","date":"2010-06-09"},{"gid":20,"title":"美国大学生创业代表团莅临今翌传媒参观交流","content":"1月19日下午,今翌传媒迎来了一批远道而来的客人----美国青年创业代表团.\r\n\r\n代表团此行的目的是做大学生创业企业参观和创业经验交流.今翌传媒副总董文涛,执行总监孔黄生热情接待了美国代表团.代表团成员对今翌传媒创业经历及企业文化表示了高度的赞扬和认同.","pic":"http://test2015.zcspin.com/thumb/9/0/5b/861_big.jpg","week":"周一","date":"2010-01-18"},{"gid":19,"title":"\u201c大学明天\u201d杯第二届上海大学生\u201c创新创业模拟大赛\u201d开始啦！","content":"你是个空有想法却不敢尝试的胆小鬼吗？ 不！\n你是个激情澎湃，渴望成功的人吗？当然！\n那就快来参加第二届创业大赛吧！\n\n这里万事具备，只欠东风，赶快把你的聪明才智秀出来，\n参与创业经历，体验创业乐趣，\n更有高额奖金唾手可及，\n未来的比尔·盖茨们，不要犹豫，赶快加入吧！","pic":null,"week":"周日","date":"2010-01-03"}]
     */

    private String message;
    private int code;
    /**
     * gid : 74
     * title : 阅览室新书上架啦
     * content : 公司六楼阅览室已整理完毕，目前上架图书有300多册，后续还有近千本图书将陆续入库，分为政治经济类、成功励志类、教辅类、名人传记类、小说、文学、艺术、杂志等系列。图书室向今翌全体员工开放，午间休息时，同事们可以在阅览室内阅读，阅览室设有书桌和座椅，可容纳10人左右。同时，节假日休息时，同事们可以办理相关手续，将书籍带回去阅读。
     公司图书室的建立，开拓了员工的知识面，提高员工的文化修养，让员工有了一个更加丰富多彩的工作环境。
     * pic : http://test2015.zcspin.com/thumb/9/8/15/1381_big.jpg
     * week : 周一
     * date : 2014-08-18
     */

    private List<DataEntity> data;


    public void setMessage(String message) { this.message = message;}


    public void setCode(int code) { this.code = code;}


    public void setData(List<DataEntity> data) { this.data = data;}


    public String getMessage() { return message;}


    public int getCode() { return code;}


    public List<DataEntity> getData() { return data;}


    public static class DataEntity {
        private int gid;
        private String title;
        private String content;
        private String pic;
        private String week;
        private String date;


        public void setGid(int gid) { this.gid = gid;}


        public void setTitle(String title) { this.title = title;}


        public void setContent(String content) { this.content = content;}


        public void setPic(String pic) { this.pic = pic;}


        public void setWeek(String week) { this.week = week;}


        public void setDate(String date) { this.date = date;}


        public int getGid() { return gid;}


        public String getTitle() { return title;}


        public String getContent() { return content;}


        public String getPic() { return pic;}


        public String getWeek() { return week;}


        public String getDate() { return date;}
    }
}
